daas/esloadtestpostsearchsimulation30x1m-1481801625181/simulation.log
[INFO] Scanning for projects...
[WARNING] 
[WARNING] Some problems were encountered while building the effective model for com.datio.daas.testPF:testPF:jar:1.0-SNAPSHOT
[WARNING] 'build.plugins.plugin.(groupId:artifactId)' must be unique but found duplicate declaration of plugin net.alchim31.maven:scala-maven-plugin @ line 62, column 21
[WARNING] 'parent.relativePath' points at com.datio.daas:daas instead of com.stratio:parent, please verify your project structure @ line 24, column 13
[WARNING] 
[WARNING] It is highly recommended to fix these problems because they threaten the stability of your build.
[WARNING] 
[WARNING] For this reason, future Maven versions might no longer support building such malformed projects.
[WARNING] 
[INFO]                                                                         
[INFO] ------------------------------------------------------------------------
[INFO] Building testPF 1.0-SNAPSHOT
[INFO] ------------------------------------------------------------------------
[INFO] 
[INFO] --- maven-clean-plugin:2.5:clean (default-clean) @ testPF ---
[INFO] Deleting /home/david/workspace/daas/testPF/target
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:resources (default-resources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/david/workspace/daas/testPF/src/main/resources
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:add-source (scala-compile-first) @ testPF ---
[INFO] Add Source directory: /home/david/workspace/daas/testPF/src/main/scala
[INFO] Add Test Source directory: /home/david/workspace/daas/testPF/src/test/scala
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:compile (scala-compile-first) @ testPF ---
[WARNING]  Expected all dependencies to require Scala version: 2.11.6
[WARNING]  com.datio.daas.testPF:testPF:1.0-SNAPSHOT requires scala version: 2.11.6
[WARNING]  io.gatling.highcharts:gatling-charts-highcharts:2.1.7 requires scala version: 2.11.7
[WARNING] Multiple versions of scala libraries detected!
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:copy-resources (copy-resources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 1 resource
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ testPF ---
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:testResources (default-testResources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 3 resources
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:testCompile (scala-test-compile) @ testPF ---
[WARNING]  Expected all dependencies to require Scala version: 2.11.6
[WARNING]  com.datio.daas.testPF:testPF:1.0-SNAPSHOT requires scala version: 2.11.6
[WARNING]  io.gatling.highcharts:gatling-charts-highcharts:2.1.7 requires scala version: 2.11.7
[WARNING] Multiple versions of scala libraries detected!
[INFO] /home/david/workspace/daas/testPF/src/test/scala:-1: info: compiling
[INFO] Compiling 21 source files to /home/david/workspace/daas/testPF/target/test-classes at 1481801603160
[INFO] prepare-compile in 0 s
[INFO] compile in 6 s
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ testPF ---
[INFO] Nothing to compile - all classes are up to date
[INFO] 
[INFO] --- maven-surefire-plugin:2.7:test (default-test) @ testPF ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ testPF ---
[WARNING] JAR will be empty - no content was marked for inclusion!
[INFO] Building jar: /home/david/workspace/daas/testPF/target/testPF-1.0-SNAPSHOT.jar
[INFO] 
[INFO] --- gatling-maven-plugin:2.1.7:execute (default) @ testPF ---
Simulation com.datiobd.daas.testPF.simulations.EsLoadTestPostSearchSimulation30x1m started...
[WARN] [12/15/2016 12:33:39.612] [Base-Simulation-akka.actor.default-dispatcher-3] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader
[WARN] [12/15/2016 12:33:39.699] [Base-Simulation-akka.actor.default-dispatcher-2] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader
[WARN] [12/15/2016 12:33:39.792] [Base-Simulation-akka.actor.default-dispatcher-4] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader

================================================================================
2016-12-15 12:33:45                                           0s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[                                                                          ]  0%
          waiting: 30     / active: 0      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-12-15 12:33:50                                           5s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1325   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=1325   KO=0     )
================================================================================


================================================================================
2016-12-15 12:33:55                                          10s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3144   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=3144   KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:00                                          15s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4887   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=4887   KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:05                                          20s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=6675   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=6675   KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:10                                          25s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=8474   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=8474   KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:15                                          30s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=10223  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=10223  KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:20                                          35s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=11970  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=11970  KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:25                                          40s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=13721  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=13721  KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:30                                          45s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=15518  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=15518  KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:35                                          50s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=17245  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=17245  KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:40                                          55s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=18985  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=18985  KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:45                                          60s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=20746  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=20746  KO=0     )
================================================================================


================================================================================
2016-12-15 12:34:48                                          62s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:30    
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=21344  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=21344  KO=0     )
================================================================================

Simulation finished
Stored in influxdb the monitoring part ElasticSearch - Before call
Stored in influxdb the monitoring part ElasticSearch - Call
Stored in influxdb the monitoring part ElasticSearch - After call
Monitoring is stored in influxdb
Opening http://localhost:3000/dashboard/db/daas-hetzner-hdw?from=1481801624876&to=1481801689583
Opening http://localhost:3000/dashboard/db/daas-hetzner-monitoring
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                      21344 (OK=21344  KO=0     )
> min response time                                     56 (OK=56     KO=-     )
> max response time                                    264 (OK=264    KO=-     )
> mean response time                                    84 (OK=84     KO=-     )
> std deviation                                         11 (OK=11     KO=-     )
> response time 50th percentile                         83 (OK=83     KO=-     )
> response time 75th percentile                         89 (OK=89     KO=-     )
> mean requests/sec                                339.214 (OK=339.214 KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                         21344 (100%)
> 800 ms < t < 1200 ms                                   0 (  0%)
> t > 1200 ms                                            0 (  0%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 0s.
Please open the following file: /home/david/workspace/daas/testPF/target/gatling/results/esloadtestpostsearchsimulation30x1m-1481801625181/index.html
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 01:51 min
[INFO] Finished at: 2016-12-15T12:35:12+01:00
[INFO] Final Memory: 18M/317M
[INFO] ------------------------------------------------------------------------